app/views/publications/index.html.erb

  <%end%>
  <% publication.reviews.each do |r| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."publication_id" = $1  [["publication_id", 2]]