app/views/responses/index.html.erb

      <%if response.user_id == response.message_for%>
        <h5>De: <%= User.find(response.user_moderator.to_i).email %></h5>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]


        <h5>De: <%= User.find(response.user_id).email %></h5>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]