app/controllers/messages_controller.rb

  def index
    @messages = Pivot.where(moderator_id: current_user).all
---
SELECT "pivots".* FROM "pivots" WHERE "pivots"."moderator_id" IS NULL