app/controllers/pivots_controller.rb

SELECT "pivots".* FROM "pivots"
---
  def index
    @pivots = Pivot.all

SELECT COUNT(*) FROM "users" WHERE "users"."moderator" = $1  [["moderator", true]]
SELECT "users".* FROM "users" WHERE "users"."moderator" = $1 ORDER BY "users"."id" ASC LIMIT $2 OFFSET $3  [["moderator", true], ["LIMIT", 1], ["OFFSET", 0]]
INSERT INTO "pivots" ("user_id", "club_name", "sport_name", "moderador_id", "club_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user_moderator_id = rand(User.where(moderator: true).all.count)
    @pivot = Pivot.new(pivot_params)

    @pivot.user_id = current_user.id
    @pivot.moderador_id = User.where(moderator: true).offset(@user_moderator_id).first.id

    respond_to do |format|
      if @pivot.save

DELETE FROM "pivots" WHERE "pivots"."id" = $1  [["id", 1]]
---
  def destroy
    @pivot.destroy

SELECT "pivots".* FROM "pivots" WHERE "pivots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_pivot
    @pivot = Pivot.find(params[:id])