app/controllers/publications_controller.rb

  def show
    @publication = Publication.find(params[:id])
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @publication = Publication.find(params[:id])
    @publication.destroy
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 1]]

  def create
    @publication = Publication.new(publications_params)
    @publication.user_id = current_user.id
    if @publication.save
---
INSERT INTO "publications" ("club_name", "club_address", "sport_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["club_name", "Club de tenis"], ["club_address", "raul labbe"], ["sport_name", "tenis"], ["user_id", 2], ["created_at", "2022-10-21 01:53:11.722142"], ["updated_at", "2022-10-21 01:53:11.722142"]]