app/controllers/responses_controller.rb

  def index
    @responses = if current_user.moderator

                 end
    Response.all
---
SELECT "responses".* FROM "responses"

  def create
    @response = Response.new(response_params)
    @response.user_id = session[:user_id]
    @response.user_moderator = session[:user_moderator]
    @response.message_for = @response.user_id if current_user.moderator == true
    @response.message_for = @response.user_moderator unless current_user.moderator == true

    redirect_to responses_path if @response.save
---
INSERT INTO "responses" ("message", "user_id", "user_moderator", "created_at", "updated_at", "message_for") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["message", "PORFA FUNCIONA"], ["user_id", 1], ["user_moderator", 3], ["created_at", "2022-10-21 01:53:32.637273"], ["updated_at", "2022-10-21 01:53:32.637273"], ["message_for", 3]]