app/controllers/reviews_controller.rb

  def new
    @publication = Publication.find(params[:publication_id])
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @publication = Publication.find(params[:publication_id])
    @review = @publication.reviews.build(reviews_params)
    redirect_to root_path if @review.save
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("publication_id", "review", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["publication_id", 1], ["review", "buenisima cancha"], ["created_at", "2022-10-21 01:38:08.683174"], ["updated_at", "2022-10-21 01:38:08.683174"]]